"espk" = "Apple hangszóró port";
"ispk" = "Beépített";
"emic" = "Mikrofon port";
"imic" = "Beépített";
"hdpn" = "Fejhallgató port";
"lini" = "Audió vonalbemenet port";
"lino" = "Audió vonalkimenet port";
"spdi" = "Optikai digitális bemeneti port";
"spdo" = "Optikai digitális kimeneti port";
"pci " = "PCI-kártya";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Hálózati eszköz";
"blue" = "Bluetooth";
"bluh" = "Bluetooth-fejhallgató";
"blus" = "Bluetooth-headset";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
"airp" = "AirPlay";
